Repository: pepr/progit2-cs
Catalog: omegat/ScottChacon_ProGit2-omegat.tmx
Source language: en
Languages: cs

source: When you have your project at a point that you want to share, you have to push it upstream.
cs: Pokud se váš projekt nachází ve stavu, kdy ho chcete sdílet s ostatními, můžete ho odeslat (push) na referenční server (upstream{empty}footnote:[Pozn. překl.: Pojem _upstream_ se používá pro vzdálený server umístěný doslova _výše proti proudu_ -- z logického pohledu. Podle konvence se často `upstream` používá i pro pojmenování takového vzdáleného serveru. Typicky jde o server, který slouží ke sdílení výsledků projektu, který se považuje v jistém smyslu za referenční -- z něj to _teče dolů po proudu_ k ostatním. Je možné, že se s tímto pojmem poprvé setkáte v okamžiku, kdy začnete používat GitHub a provedete takzvaný _Fork_ jiného projektu. V nápovědě přímo najdete příkazy, ve který se slovo _upstream_ vyskytuje -- https://help.github.com/articles/fork-a-repo/[GitHub Help: Fork a Repo]. V této souvislosti chápejte pojmy _vzdálený server_ a _vzdálený repozitář_ jako shodné. Repozitář označovaný pojmem _upstream_ je ten, ze kterého jste na GitHub provedli _fork_.]).

source: When you make a commit, Git stores a commit object that contains a pointer to the snapshot of the content you staged.
cs: Když zapíšete revizi, uloží Git objekt revize (commit object), který obsahuje odkaz na snímek obsahu, který jste připravili k zapsání.

source: When you notice issues, you should be able to easily figure out what commit introduced them, when, and by whom.
cs: Vyskytnou-li se jakékoli problémy, měli byste být schopni snadno odhalit závadnou revizi, kdo je jejím autorem a kdy byla zapsána.

source: When you rebase stuff, you're abandoning existing commits and creating new ones that are similar but different.
cs: Pokud provedete přeskládání, zahazujete existující objekty revize (commits) a vytváříte nové, které jsou podobné, ale přesto jiné.

source: When you restart your machine, your Git daemon will start automatically and respawn if it goes down.
cs: Při restartování počítače se démon Git spustí automaticky. V případě pádu démona bude jeho činnost automaticky obnovena.

source: When you run `git commit`, it creates the commit object, specifying the parent of that commit object to be whatever SHA-1 value the reference in HEAD points to.
cs: Spustíte-li příkaz `git commit`, systém vytvoří objekt revize, jehož rodičem bude hodnota SHA-1, na niž ukazuje reference v souboru HEAD.

source: When you run `git init` in a new or existing directory, Git creates the `.git` directory, which is where almost everything that Git stores and manipulates is located.
cs: Spustíte-li v novém nebo existujícím adresáři příkaz `git init`, Git vytvoří adresář `.git`, tj. místo, kde je umístěno téměř vše, co Git ukládá a s čím manipuluje.

source: When you run `git log` in this project, you should get output that looks something like this:(((git commands, log)))
cs: Po zadání příkazu `git log` byste pro tento projekt měli dostat výstup, který vypadá zhruba takto:(((git commands, log)))

source: When you save and close the editor, the editor writes a new commit containing that message and makes it your new last commit.
cs: Po uložení změn a zavření editoru zapíše editor novou revizi, která bude obsahovat upravenou zprávu a která bude vaší novou poslední revizí.

source: When you save and exit the editor, Git applies all three changes and then puts you back into the editor to merge the three commit messages:
cs: Po uložení změn a zavření editoru aplikuje Git všechny tři změny a znovu otevře textový editor, abyste sloučili všechny zprávy k revizím:

source: When you save and exit the editor, Git rewinds to the parent of the first commit in your list, applies the first commit (`f7f3f6d`), applies the second (`310154e`), and drops you to the console.
cs: Když uložíte změny a zavřete editor, Git se vrátí na rodiče první revize ve vašem seznamu, aplikuje první revizi (`f7f3f6d`), aplikuje druhou revizi (`310154e`) a ocitnete se znovu na konzoli.

source: When you save and exit the editor, Git rewinds you back to the last commit in that list and drops you on the command line with the following message:
cs: Po uložení změn a zavření editoru vás Git vrátí zpět na poslední revizi v seznamu a zobrazí vám příkazový řádek s touto zprávou:

source: When you save and exit the editor, Git rewinds your branch to the parent of these commits, applies `310154e` and then `f7f3f6d`, and then stops.
cs: Jakmile uložíte změny a zavřete editor, Git vrátí vaši větev zpět na rodiče těchto revizí, aplikuje revizi `310154e`, po ní revizi `f7f3f6d` a zastaví.

source: When you save that, you have a single commit that introduces the changes of all three previous commits.
cs: Po uložení zprávy budete mít jedinou revizi, která bude obsahovat všechny změny předchozích tří revizí.

source: When you want to share that work, you merge it into your own master branch, then fetch and merge `origin/master` if it has changed, and finally push to the `master` branch on the server.
cs: Chcete-li tuto práci sdílet, začleníte ji (merge) do své větve `master`. Poté vyzvednete změny (fetch) a pokud se větev `origin/master` změnila, začleníte ji (merge). Nakonec odešlete (push) všechna data do větve `master` na serveru.

source: When you're branching and merging, everything is being done only in your Git repository – no server communication is happening.
cs: Veškeré větvení a slučování se odehrává pouze ve vašem gitovém repozitáři -- neprobíhá žádná komunikace se serverem.

source: When you're using Git more heavily, however, you may see much more information from `git remote show`:
cs: Pokud však Git používáte intenzivněji, může vám příkaz `git remote show` zobrazit mnohem více informací:

source: When your branch work is finished and you're ready to contribute it back to the maintainers, go to the original project page and click the ``Fork'' button, creating your own writable fork of the project.
cs: Až budete s prací ve větvi hotovi a budete ji chtít poslat zpět správcům, přejděte na původní stránku projektu a klikněte na tlačítko „Fork“, čímž vytvoříte vlastní odštěpený projekt, do kterého budete moci zapisovat.

source: When you’re finished, you should run `git bisect reset` to reset your HEAD to where you were before you started, or you’ll end up in a weird state:
cs: Až vyhledávání dokončíte, měli byste použít příkaz `git bisect reset`, abyste vrátili ukazatel HEAD na pozici, z níž jste vyhledávání zahajovali. Jinak byste skončili v nějakém podivném stavu:

source: Whether you maintain a canonical repository or want to help by verifying or approving patches, you need to know how to accept work in a way that is clearest for other contributors and sustainable by you over the long run.
cs: Ať spravujete standardní repozitář, nebo pomáháte při ověřování či schvalování záplat, budete muset vědět, jak přijímat práci ostatních přispěvatelů, a to způsobem, který je pro ostatní co nejčistší a pro vás dlouhodobě udržitelný.

source: While I still don't love that conflict of interests, the importance of GitHub in the Git community is unavoidable.
cs: I když stále nemám dobrý pocit z uvedeného konfliktu zájmů, důležitosti GitHub pro komunitu kolem systému Git se nedá vyhnout.

source: While ``master'' is the default name for a starting branch when you run `git init` which is the only reason it's widely used, ``origin'' is the default name for a remote when you run `git clone`.
cs: Zatímco „master“ je výchozí jméno pro počáteční větev po provedení `git init` -- což je jediný důvod, proč se tak často používá --{empty}, „origin“ je výchozí jméno pro vzdálený repozitář po provedení příkazu `git clone`.

source: While most of the core commands and concepts are still valid today as the Git core team is pretty fantastic at keeping things backward compatible, there have been some significant additions and changes in the community surrounding Git.
cs: Většina základních příkazů a konceptů zůstala dodnes v platnosti, protože tým systému Git odvádí fantastickou práci, aby zachoval zpětnou kompatibilitu. Z komunity systému Git přesto vzešlo několik významných přídavků a změn.

source: While on a Windows system, if you want to use a different text editor, such as Notepad++, you can do the following:
cs: Chcete-li používat jiný textový editor, například Notepad++, můžete použít následující příkaz:

source: While she waits for feedback from John, Jessica decides to start working on `featureB` with Josie.
cs: Zatímco čeká na zpětnou vazbu od Johna, rozhodne se, že začne pracovat spolu s Josie na úkolu `featureB`.

source: While the `git status` output is pretty comprehensive, it's also quite wordy.
cs: Výstup příkazu `git status` je sice poměrně srozumitelný, ale je také dost ukecaný.

source: Why is it so special?
cs: V čem je tak zvláštní?

source: With Git's branching model, it's possible for hundreds of developers to successfully work on a single project through dozens of branches simultaneously.
cs: Model větvení Gitu umožňuje, aby na jednom projektu pracovaly stovky vývojářů a využívali při tom souběžně desítky větví.

source: With Git, you don't have to deploy your fix along with the `iss53` changes you've made, and you don't have to put a lot of effort into reverting those changes before you can work on applying your fix to what is in production.
cs: Při používání Gitu nemusíte nasadit opravu společně se změnami, které jste provedli při řešení problému `iss53`. Před opravou produkční verze nemusíte ani vynakládat velké úsilí a změny zase rušit.

source: With the `rebase` command, you can take all the changes that were committed on one branch and replay them on another one.(((git commands, rebase)))
cs: Příkazem `rebase` vezmete všechny změny, které byly zapsány na jedné větvi, a necháte je přehrát na jinou větev.(((git příkazy, rebase)))

source: With the interactive rebase tool, you can then stop after each commit you want to modify and change the message, add files, or do whatever you wish.
cs: S interaktivním nástrojem přeskládání pak můžete zastavit po každé revizi, kterou chcete upravit, a změnit u ní zprávu, přidat soubory nebo cokoli dalšího.

source: With these basic commands, you can use the interactive add mode to deal with your staging area a little more easily.
cs: Pomocí těchto základních příkazů můžete použít režim interaktivního přidávání, a snáze tak ovládat svou oblast připravených změn.

source: With these tools, you can much more easily let Git know what commit or commits you want to inspect.
cs: Pomocí těchto nástrojů můžete v systému Git daleko snáze specifikovat, kterou revizi nebo které revize chcete zobrazit.

source: With this method, you can quickly get a read/write Git server up and running for a handful of developers.
cs: Tímto způsobem lze rychle vytvořit a spustit server Git ke čtení i zápisu pro menší počet vývojářů.

source: Without the `-3` option, it looks like a conflict.
cs: Bez parametru `-3` se celá situace tváří jako konflikt.

source: Wrap it to about 72 characters or so.
cs: Zalamujte řádky přibližně na 72 znaků.

source: Write out that tree (recording the state of the staging area or index to a tree object) and see what it looks like:
cs: Uložte tento strom (zaznamenáním stavu oblasti připravených změn neboli indexu do objektu stromu) a prohlédněte si výsledek:

source: You accomplish that by using refspecs to push.
cs: Tady vám při odesílání větví pomůže vzorec refspec.

source: You also have access to the user doing the pushing if the push is being run over SSH.
cs: Pokud jsou revize odesílány prostřednictvím SSH, budete mít přístup také k uživateli, který data odesílá.

source: You also need to make sure these tools are executable:
cs: Dále se potřebujete také ujistit, že lze tyto nástroje spustit:

source: You and the other developers all have push access to the repository.
cs: Vy a vaši ostatní vývojáři máte všichni oprávnění odesílat změny do repozitáře (push).

source: You begin by reading this data into a structure that you can use.
cs: Začnete načtením těchto dat do struktury, kterou můžete použít.

source: You branched a topic branch (`server`) to add some server-side functionality to your project, and made a commit.
cs: Vytvořili jste novou tématickou větev (`server`), abyste v ní do projektu přidali novou funkčnost na straně serveru, a zapsali jste revizi.

source: You can accomplish that with a few `git add` commands that specify the files you want to track, followed by a `git commit`:
cs: Můžete tak učinit pomocí několika příkazů `git add`, jimiž určíte soubory, které chcete sledovat, a poté provedete příkaz provedete `git commit`:

source: You can accomplish the same task with `--tree-filter` if you want.
cs: Pokud chcete, můžete provést stejný úkon i pomocí parametru `--tree-filter`.

source: You can add it after the fact.
cs: Značku můžete přidat dodatečně.

source: You can add it as a new remote reference to the project you're currently working on by running the `git remote add` command as we covered in <<_git_basics_chapter>>.
cs: Můžete ho přidat jako novou vzdálenou referenci k projektu, na němž právě pracujete, spuštěním příkazu `git remote add` -- jak jsme si ukázali v kapitole <<_git_basics_chapter>>.

source: You can add the following line to your Git attributes file:
cs: Do souboru s atributy Git můžete přidat následující řádek:

source: You can also change them at any time by running through the commands again.
cs: Opětovným použitím příkazů můžete nastavení kdykoliv změnit.

source: You can also check what Git thinks a specific key's value is by typing `git config <key>`:(((git commands, config)))
cs: Zadáním `git config <klíč>` můžete zkontrolovat, jakou hodnotu bude Git pro konkrétní klíč uvažovat:(((git příkazy, config)))

source: You can also continue this concept, having an integrate branch where all the work is merged together.
cs: Tento koncept můžete dále rozšířit o integrační větev, v níž budete veškerou práci slučovat.

source: You can also create a zip archive in much the same way, but by passing the `--format=zip` option to `git archive`:
cs: Stejným způsobem můžete vytvořit také archiv zip. K příkazu `git archive` stačí přidat parametr `--format=zip`:

source: You can also do `git push origin serverfix:serverfix`, which does the same thing – it says, ``Take my serverfix and make it the remote's serverfix.'' You can use this format to push a local branch into a remote branch that is named differently.
cs: Můžete zadat také příkaz `git push origin serverfix:serverfix`, který provede totéž. Vyjadřuje: „Vezmi mou větev `serverfix` a udělej z ní `serverfix` ve vzdáleném repozitáři.“ Tento formát můžete použít k odeslání lokální větve do vzdálené větve, která se jmenuje jinak.

source: You can also do this with content in files.
cs: Totéž můžete udělat také s obsahem v souborech.

source: You can also filter the list to commits that match some search criteria.
cs: Ze seznamu také můžete vyfiltrovat revize, které odpovídají určitým vyhledávacím kritériím.

source: You can also get the same sort of information that `svn info` gives you by running `git svn info`:
cs: Stejné informace, jaké poskytuje příkaz `svn info`, získáte příkazem `git svn info`:

source: You can also have your rebase replay on something other than the rebase target branch.
cs: Posloupnost změn můžete aplikovat i na něco jiného než na cílovou větev pro přeskládání.

source: You can also install it as part of the GitHub for Mac install.
cs: Můžete jej nainstalovat také jako součást instalace GitHub for Mac.

source: You can also leave off one side of the syntax to have Git assume HEAD.
cs: Jednu stranu intervalu můžete zcela vynechat, Git na její místo automaticky dosadí HEAD.

source: You can also manually edit this file, but again a safer command exists to do so: `symbolic-ref`.
cs: Soubor můžete editovat také ručně, ale opět existuje i bezpečnější příkaz: `symbolic-ref`.

source: You can also run `git stash pop` to apply the stash and then immediately drop it from your stack.
cs: Můžete také spustit příkaz `git stash pop`, jímž odklad aplikujete a současně ho odstraníte ze zásobníku.

source: You can also run something like `make` or `make tests` or whatever you have that runs automated tests for you.
cs: Podobně můžete spustit také příkaz `make` nebo `make tests` či cokoli jiného, čím spouštíte automatické testování.

source: You can also search for tags with a particular pattern.
cs: Značky lze vyhledávat také pomocí konkrétní masky.

source: You can also see this easily with the `git log` command.
cs: Můžete si to snadno zviditelnit příkazem `git log`.

source: You can also send the patches through an SMTP server.
cs: Záplaty můžete odesílat i přes SMTP server.

source: You can also serve your repositories read-only over HTTPS, which means you can encrypt the content transfer; or you can go so far as to make the clients use specific signed SSL certificates.
cs: Své repozitáře můžete zpřístupnit ke čtení prostřednictvím protokolu HTTPS, což znamená, že se přenášený obsah šifruje. Nebo můžete zajít ještě dál a vyžadovat, aby klienti používali konkrétní podepsané SSL certifikáty.

source: You can also set the value of HEAD:
cs: Hodnotu pro soubor HEAD můžete také nastavit:

source: You can also simplify this by running a `git pull --rebase` instead of a normal `git pull`.
cs: Můžete si to trochu zjednodušit spuštěním `git pull --rebase` místo běžného `git pull`.

source: You can also specify `-v`, which shows you the URLs that Git has stored for the shortname to be used when reading and writing to that remote:
cs: Můžete také přidat `-v`, což vede k zobrazení adresy URL, kterou Git pro zkrácené jméno uložil a která se používá při čtení z a při zápisu na tento vzdálený server:

source: You can also specify multiple refspecs for fetching in your configuration file.
cs: V konfiguračním souboru můžete také použít více vzorců refspec pro vyzvedávání dat.

source: You can also specify multiple refspecs.
cs: Použít lze také kombinaci několika vzorců refspec.

source: You can also tag commits after you've moved past them.
cs: Označit můžete i revize, které už máte za sebou.

source: You can also tell `git svn` not to include the metadata that Subversion normally imports, by passing `--no-metadata` to the `clone` or `init` command.
cs: Nástroji `git svn` můžete také zadat, aby ignoroval metadata, která systém Subversion normálně importuje: zadejte parametr `--no-metadata` k příkazu `clone` nebo `init`.

source: You can also use `-2`, which limits the output to only the last two entries:
cs: Můžete přidat volbu `-2`, která omezí výpis pouze na dva poslední záznamy:

source: You can also use a series of summarizing options with `git log`.
cs: Ve spojení s příkazem `git log` můžete použít také celou řadu shrnujících voleb.

source: You can also use interactive rebases to reorder or remove commits entirely.
cs: Interaktivní přeskládání můžete použít rovněž ke změně pořadí revizí nebo k jejich odstranění.

source: You can also use the refspec to delete references from the remote server by running something like this:
cs: Vzorce refspec můžete využít také k mazání referencí ze vzdáleného serveru. Spustit lze například příkaz následujícího znění:

source: You can also use this string as the target of a checkout or show command, although it relies on the abbreviated SHA-1 value at the end, so it may not be valid forever.
cs: Tento řetězec můžete také použít jako cíl příkazu checkout nebo show, ačkoli ty pracují se zkrácenou hodnotou SHA-1, a tak nebudou platné navždy.

source: You can also use this syntax to see where a branch was some specific amount of time ago.
cs: Tuto syntaxi můžete použít také k zobrazení pozice, na níž se větev nacházela před určitou dobou.

source: You can also use two asterisks to match nested directories; `a/**/z` would match `a/z`, `a/b/z`, `a/b/c/z`, and so on.
cs: Použitím dvou hvězdiček můžeme popsat zanořené adresáře; `a/**/z` popisuje `a/z`, `a/b/z`, `a/b/c/z` a tak dále.

source: You can also verify that this is a tree object:
cs: Můžete si také ověřit, že jde skutečně o objekt stromu:

source: You can bisect the code to find out.
cs: K odhalení problému můžete použít příkaz bisect (tedy „rozpůlit“).

source: You can calculate the SHA-1 value of a string in Ruby by including the SHA1 digest library with the `require` command and then calling `Digest::SHA1.hexdigest()` with the string:
cs: V Ruby můžete hodnotu SHA-1 daného řetězce spočítat tak, že příkazem `require` připojíte knihovnu pro počítání SHA1 a zavoláte `Digest::SHA1.hexdigest()` s daným řetězcem:

source: You can close the ticket in your ticket-tracking system, and delete the branch:
cs: V systému sledování tiketů můžete tento tiket uzavřít a větev můžete smazat:

source: You can create a new directory and then run `git init` in it for a starting point, and then run your script:
cs: Můžete vytvořit nový adresář a spustit v něm příkaz `git init`, jímž si vytvoříte nový výchozí bod. Poté spusťte svůj skript:

source: You can decide what files go into which commits right before you commit with the staging area, you can decide that you didn’t mean to be working on something yet with the stash command, and you can rewrite commits that already happened so they look like they happened in a different way.
cs: Jaké soubory budou součástí jaké revize? To můžete rozhodnout až těsně před tím, než soubory zapíšete z oblasti připravených změn. Můžete se rozmyslet, že jste na něčem ještě nechtěli pracovat, a použít možnost odložení. A stejně tak můžete přepsat už jednou zapsané revize. Budou vypadat, jako by byly zapsány v jiné podobě.

source: You can delete a remote branch using the `--delete` option to `git push`.
cs: Vzdálenou větev můžete smazat příkazem `git push` s volbou `--delete`.

source: You can delete it with the `-d` option to `git branch`:
cs: Větev smažete přidáním volby `-d` k příkazu `git branch`:

source: You can disable settings by either leaving them out of the setting string or prepending a `-` in front of the value.
cs: Funkci vypnete buď tím, že ji z řetězce nastavení zcela vynecháte, nebo tím, že před hodnotu vložíte znak `-`.

source: You can do so with the `sed` command on Unix systems:
cs: V systémech Unix to lze provést příkazem `sed`:

source: You can do this by listing them with the `bisect start` command if you want, listing the known bad commit first and the known good commit second:
cs: Chcete-li, můžete to provést příkazem `bisect start` –- jako první uvedete známou revizi s chybou, jako druhá bude následovat poslední známá dobrá revize:

source: You can download that tool from the GitHub for Mac website, at http://mac.github.com[].
cs: GitHub for Mac můžete stáhnout z jeho domácí stránky http://mac.github.com[].

source: You can download this from the GitHub for Windows website, at http://windows.github.com[].
cs: Instalátor GitHub for Windows můžete stáhnout z jeho webovské stránky http://windows.github.com[].

source: You can easily check to see if you have a key already by going to that directory and listing the contents:
cs: Nejsnazší způsob kontroly, zda už klíč vlastníte, je přejít do tohoto adresáře a zjistit jeho obsah:

source: You can easily see that the file size and image dimensions have both changed.
cs: Jasně vidíte, že se změnila jak velikost souboru, tak rozměry obrázku.

source: You can easily see this by running a simple `git log` command that shows you where the branch pointers are pointing.
cs: Snadno to můžeme zviditelnit spuštěním příkazu `git log`, který vám ukáže, kam reference větví ukazují.

source: You can easily see what commits modified this file:
cs: Pomocí snadného příkazu lze zjistit, jaké revize tento soubor změnil:
